Documents/ВозвратТары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ВозвратТары</Name>
			<BasedOn>
				<xr:Item>Document.ОтгрузкаЗаказов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccumulationRegister.Возвраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отгрузка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отгружено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Возвращено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокПосле</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВозвратТары/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВозвратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВозвратыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтгрузкаПриИзменении(Элемент)
	Если Вопрос("Хотите обновить список возвратов?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ВозвратыЗаполнить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВозвратыЗаполнить()
	Объект.Возвраты.Очистить();
	
	Для Каждого НакладнаяСтрока Из Объект.Отгрузка.Накладные Цикл
		Для Каждого ТоварСтрока Из НакладнаяСтрока.Накладная.Товары Цикл
			Если ТоварСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТоварСтрока.Товар.Тара) Тогда
				Строка = Объект.Возвраты.Добавить();
				Строка.Контрагент = НакладнаяСтрока.Контрагент;
				Строка.Тара = ТоварСтрока.Товар.Тара;
				Строка.Отгружено = ТоварСтрока.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Таблица = Объект.Возвраты.Выгрузить();
	Таблица.Свернуть("Контрагент,Тара", "Отгружено,Возвращено");
	
	Объект.Возвраты.Загрузить(Таблица);
КонецПроцедуры
